Autodesk.Revit.DB.HigherDLLCallUtils.GetAvaliableLayerModifierTypes(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExportLayerKey)
Gets all the avaliable layer modifier types for the layer key.
document:
A Revit document to retrieve avaliable layer modifier types from.
exportLayerKey:
The export layer key to specify wich category and subCategory will be used to get the layer modifier types.
Returns:
The layer modifier types.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.HigherDLLCallUtils.GetAddInNameFromDocument(Autodesk.Revit.DB.AddInId,Autodesk.Revit.DB.Document)
name of application associated with this ApplicationId
First attempts to obtain the name from AddInIds stored in the document.
If unsuccessful, attempts to obtain the name from loaded Third Party AddIns.
addInId:
addInId
aDoc:
target document
Returns:
name of application
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.HigherDLLCallUtils
Used for public apis having higher dll call in proxy layer.